04_OpenFoam/_Tut_02/OpenFOAM-14/incompressibleVoF/containerDischarge2D/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [turbulentKineticEnergy];

internalField   uniform 0.0001;

boundaryField
{
    "(left|right|atmosphere)"
    {
        type            inletOutlet;
        inletValue      $internalField;
    }

    wall
    {
        type            kqRWallFunction;
        value           $internalField;
    }
}

// ************************************************************************* //
